export type SiteConfig = typeof siteConfig;

export const siteConfig = {
  name: "منازل العمران",
  description: "منازل العمران للعقارات",
  navItems: [
    {
      label: "الرئيسية",
      href: "/",
    },
    {
      label: "عن الشركة",
      href: "/about",
    },
    {
      label: "مشاريعنا",
      href: "/projects",
    },
    // {
    //   label: "خدماتنا",
    //   href: "/services",
    // },
    {
      label: "اتصل بنا",
      href: "/contact",
    },
  ],

  // links: {
  //   github: "https://github.com/heroui-inc/heroui",
  //   twitter: "https://twitter.com/hero_ui",
  //   docs: "https://heroui.com",
  //   discord: "https://discord.gg/9b6yyZKmH4",
  //   sponsor: "https://patreon.com/jrgarciadev",
  // },
  links: {
    backend: "https://admin.omranhouses.com/api",
    github: "",
    twitter: "",
    docs: "",
    discord: "",
    sponsor: "",
  },
  serviceList: [
    {
      title: "التطوير العقاري",
      icon: "./icons/blueprint.png",
      description:
        "منهجنا الشامل للتطوير يغطي التصميم إدارة العقود والمشتريات. الإنشاءات، وتعهد المشاريع. ويعمل في هذه التخصصات فريق عمل يتسم بالخبرة والتخصص بإدارة المشاريع، مما يتيح لنا تولي عمليات التطوير العقاري بالكامل. قوة وامانة !",
    },
    {
      title: "الإنشاء والتعمير :",
      icon: "./icons/blueprint-1.png",
      description:
        "أحد أهم الخدمات التي تقدمها منازل العمران الإنشاء والتعمير المقاولات)، تعتزم شركتنا دوماً الاستمرار بمواكبة التطور السريع في مجال تقنيات البناء والمقاولات وإدارة المشاريع والتي لا يمكن تحقيقها الا من خلال توفير قوى عاملة متقنة ومتمكنة من عملها بإشراف مهندسين ذوي خبرة عريقة في هذا المجال.",
    },
    {
      title: "اتحاد الملاك",
      icon: "./icons/blueprint-2.png",
      description:
        "نسعى جاهدين في ضمان بقاء عملائنا سعداء طوال فترة استخدام منتجاتنا بالكامل وذلك لنبني علاقات مع عملائنا تدوم مدى الحياة : فإننا نقوم بتقديم أفضل خدمات ما بعد البيع عن طريق قسم مختص لتلبية احتياجات عملائناالكرام.",
    },
    {
      title: "التصميم والديكور",
      icon: "./icons/investment.png",
      description:
        "الحرصنا على مواكبة الحداثة في مجال التصميم والديكور تم انشاء قسم مختص يقوم بعمل التصاميم بأسلوب حياة متفرد من الداخل والخارج باستخدام طرق حديثة عصرية : وتقدم الخدمة لجميع الأفراد والمنشآت .",
    },
    {
      title: "التسويق",
      icon: "./icons/property.png",
      description:
        "من أجل الحفاظ على قيمة منتجاتنا نلتزم في منازل العمران باستخدام منهجيات تسويقية متعددة كالتسويق الوارد والتسويق المحدد والتسويق الالكتروني وغيرها من اجل تسويق عقارات عملائنا بطرق سلسة تتسم بالحداثة والإنجاز عن طريق طاقم عمل احترافي ذو خبرة وكفاءة عالية",
    },
  ],
  serverDescription:
    "تلتزم - منازل العمران بتوفير باقة متنوعة من الخدمات المتفوقة والحلول المبتكرة التي تلبي احتياجات العملاء بدءًا من مرحلة التخطيط للمشروع وصولا إلى منح العميل تجربة حياة استثنائية.",

  power: [
    {
      title: "جودة المنتجات",
      description:
        "نحــرص علــى الحفــاظ علــى جــودة منتجاتنــا كمبــدأ نؤمـن بـه، ونهـدف مـن خلال الارتقـاء بمسـتوى الجــودة إلــى تحقيــق رضــا العــملاء، والاســتفادة مــن العقارعلى المدى المتوسط والبعيد.",
    },
    {
      title: "البحث عن الفرص ",
      description:
        "البحث عن الفرص العقارية المناسبة، لتتم دراستها دراسة تحليلية وتفصيلية لنضمن فرصة الاستثمار فيها وتحقيق العوائد على المدى المتوسط والبعيد.",
    },
    {
      title: "التصميم المثالي",
      description:
        "نهتم باستغلال المساحات بكفاءة عالية، لذلك نعتمد في كثير من تصاميمنا على التصميم الحديث واستخدام أجود أنواع المواد للبناء.",
    },
    {
      title: "ضمانات ممتدة ",
      description:
        "نقدم في منازل العمران ضمانات شاملة وطويلة المدى على جميع المشاريع تصل إلى 20 سنة على الإنشاءات 5 سنوات على الكهرباء والسباكة، ونقدم خدمة اتحاد الملاك لمدة سنة مجانا خصيصا لشركاء نجاحنا.",
    },
    {
      title: "إستثمار آمن",
      description:
        "يعتبر الاستثمار في العقارات احدى اهم وسائل الاستثمار الآمنة التي تضمن الحفاظ على رأس المال، وكذلك من الاصول التي ترتفع قيمتها بمرور الوقت.",
    },
    {
      title: "أسعار منافسة",
      description:
        "عن طريق استخدام استراتيجية السعر التنافسي نقوم بتحليل أسعار السوق وتحديد سعر المنتجات بقيم منافسة الأسعار المنافسين ومناسبة لشركاء نجاحنا الأعزاء.",
    },
    {
      title: "أنظمة بناء متطورة",
      description:
        "لأننا نؤمن بأهمية استغلال التكنولوجيا في الجانب العقاري نقوم بتوفير أحدث وأفضل الأنظمة الذكية للمنازل والوحدات السكنية والتجارية مما يساهم في خفض استهلاك الكهرباء، والمحافظة على الطبيعة.",
    },
  ],

  message:
    "نقــدم لعملائنــا منتجــات وخدمــات عقاريــة متميــزة بجــودة عاليــة وأســعار تنافســية مــن خلال عمــل مؤسســي و كــوادر مؤهلــة مــع كامــل التزامنــا بالقيم والمبادئ الإسلامية.",

  intro:
    "                            نشــأت منازل العمران مــع التــزام يتمَّثل بتســليم مشــاريع عقاريــة رائــدة،\n" +
    "                            سـواء كانـت منـازل جديـدة أو اسـتثمار عقـاري ُمتمّيـز، بالإضافـة إلـى تمكيـن\n" +
    "                            كل مالـك أو ُمسـتثمر فـي المسـتقبل مـن الاسـتمتاع بأسـلوب حيـاة معاصـر\n" +
    "                            يتناســب مــع تطلعاتــه، ليقــوده للنجــاح ويســاهم بحفــظ ثرواتــه للأجيــال\n" +
    "                            القادمة.",

  goals: [
    "تطوير آليات تمويل بصيغ استثمارية.",
    "بناء علاقات إستراتيجية وفاعلة مع المستثمرين و المكاتب الهندسيةوالمقاولين والموردين.",
    "بناء علامة تجارية متميزة.",
    "المساهمة الفاعلة برفع وعي أفراد المجتمع بمجالات وأهمية جودةالمساكن",
  ],
  vision:
    "أن نكـون الشـريك الاسـتراتيجي الُمفضـل لتقديـم منتجـات وخدمـات عقارية إبداعية ومتميزة تلبي احتياجات العملاء",

  morals: [
    "الالتزام بالشريعة الإسلامية : التزامنا بها يمثل نواة مصداقيتنا وأساس علاقاتنامع عملائنا وشركائنا وطريقنا لبناء جسر ثقة بيننا وبينهم.",
    "عملاؤنا محور اهتمامنا : توفير تجربة عملاء استثنائية في كافة المراحل.",
    "المصداقّية : الثقة، الأمانة والاهتمام والشفافـية تمـــثل أسلــوبنا في التعامل مع عملائنا، ووسيلتنا للوصول والتواصل مع شركائنا وأساس تصرفاتنا داخل بيئة العمل.",
    "الإبداع : نهتم بإيجاد وخلق أفكار وأساليب جديدة، والاستمرار في تطوير الأفكارالإبداعّية.",
  ],
};
